# Pandas Basic Assignment

### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
list_of_numbers = ['4', '8', '15', '16', '23']
x = pd.Series(list_of_numbers)

In [3]:
x

0     4
1     8
2    15
3    16
4    23
dtype: object

In [4]:
type(x)

pandas.core.series.Series

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [5]:
variable = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10']
print(pd.Series(variable))

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: object

### Create a Pandas DataFrame and print the DataFrame

In [6]:
def createSeries(series_list):
    series_list = pd.Series(series_list)
    return series_list

name = createSeries(['Alice', 'Bob', 'Claire'])
age = createSeries([25, 30, 27])
gender = createSeries(['Female', 'Male', 'Female'])

data = {
    'Name' : name,
    'Age' : age,
    'Gender' : gender
}

df = pd.concat(data, axis = 1)

In [7]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

- DataFrame refers to a data structure that represents data in a 2-dimensional coloumn-row reoresentation like spreadsheets

- The main difference between DataFrame and Series is that Series a single dimention data type, means it can only represent coloumns as it outputs, while DataFrame being a 2-Dimentionanl data structure, can represent two dimention data

In [9]:
# Creating a series
data1 = [10, 20, 30, 40, 50 ,60]
index = ['a', 'b', 'c', 'd', 'e', 'f']
series = pd.Series(data1, index=index)

# Creating a dataframe
data2 = {'a' : ['1', '2', '3'],
        'b' : ['4', '5', '6']
        }
df = pd.DataFrame(data2)

In [10]:
series

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

In [11]:
df

   a  b
0  1  4
1  2  5
2  3  6

### What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

- **Reading csv files:** this can be used to read data from a csv file that is locally stored to the user's system. Here's a suitable usecase of it

In [ ]:
import pandas as pd
df = pd.read_csv(file_name)

- **Viewing Specific Number of data from a dataset:** This can be used in order to view what type of data is being given to the developer.

In [12]:
df.head(1)

   a  b
0  1  4

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

DataFrame is mutable, series and nature can't be mutable

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [17]:
def dataframe_creation(series):
    series = pd.Series(series)
    return series

name = dataframe_creation(['Nick', 'Rohan', 'Rahul'])
course = dataframe_creation(['DS Masters', 'Java', 'DS Masters'])

student_data = {
    'Name' : name,
    'course' : course
}

final_data = pd.concat(student_data, axis = 1)

In [18]:
final_data

    Name      course
0   Nick  DS Masters
1  Rohan        Java
2  Rahul  DS Masters